int/resources/objectRepo/xmlTemplates/opera/ChainConfig/req_CreateCommunicationMethodsEntDetails.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateCommunicationMethodsEntDetailsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:CommunicationMethodsEntDetails>
            <v91:CommunicationMethodsEntDetail>
               <v91:Code/>
               <v91:Description>
                  <v91:DefaultText/>
                  <v91:TranslatedTexts>
                     <v91:Text Lang="?"/>
                  </v91:TranslatedTexts>
               </v91:Description>
               <v91:DisplayOrder/>
            </v91:CommunicationMethodsEntDetail>
         </v9:CommunicationMethodsEntDetails>
      </v9:CreateCommunicationMethodsEntDetailsRQ>
   </soapenv:Body>
</soapenv:Envelope>